---
type: IFCLegacyStairOrRamp
namespace: Autodesk.Revit.DB.IFC
version: 2024
members: 12
tags: [revit-api, class]
---

# IFCLegacyStairOrRamp

`Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp` · Revit 2024 · 12 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetBoundaryLines | 2015 | `public IList < CurveLoop > GetBoundaryLines ()` |
| Method | GetLandingGeometries | 2013 | `public IList < IList < GeometryObject >> GetLandingGeometries ()` |
| Method | GetNumberOfRisers | 2013 | `public IList < int > GetNumberOfRisers ()` |
| Method | GetNumberOfTreads | 2013 | `public IList < int > GetNumberOfTreads ()` |
| Method | GetRunGeometries | 2013 | `public IList < IList < GeometryObject >> GetRunGeometries ()` |
| Method | GetStringerGeometries | 2013 | `public IList < GeometryObject > GetStringerGeometries ()` |
| Method | GetTreadsLength | 2013 | `public IList < double > GetTreadsLength ()` |
| Method | GetWalkLines | 2015 | `public IList < IList < Curve >> GetWalkLines ()` |
| Property | IsRamp | 2013 | `public bool IsRamp { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | RiserHeight | 2013 | `public double RiserHeight { get ; }` |